[ 
  {
    "version": "v1.13.0",
    "date": "04/11/2025 - 16:00",
    "changes": [
      "🔥 REFONTE COMPLÈTE DU PANEL D'ADMINISTRATION : Interface moderne avec authentification sécurisée et gestion avancée.",
      "🛡️ Système d'authentification : Connexion par mot de passe, protection anti-brute force (verrouillage 15min après 3 échecs).",
      "🏷️ Badges d'importance visuels : Sélection intuitive de l'importance des manuels (1-10) avec badges colorés cliquables.",
      "📂 Gestion complète des catégories : Création/modification/suppression avec palette de couleurs et contrôles de visibilité.",
      "👥 Affichage moderne des membres : Interface en cartes individuelles avec nom/ID séparés et compteurs en temps réel.",
      "👁️ Contrôles de visibilité avancés : Toggles modernes pour masquer/afficher catégories et éléments.",
      "📊 Statistiques dynamiques : Compteurs temps réel des manuels, catégories, grades, spécialités et membres totaux.",
      "🎨 Interface utilisateur modernisée : Design responsive, onglets fluides, modales animées, notifications système.",
      "🔧 Outils d'administration : Export de sauvegarde JSON, diagnostic système, suppression sécurisée des données.",
      "💾 Sauvegarde hybride : Système de backup automatique local + serveur avec récupération d'urgence.",
      "🗑️ Suppression complète du système de documents et signatures : Nettoyage total des fonctionnalités obsolètes.",
      "📋 Gestion centralisée des données : Interface unifiée pour manuels.json, grades.json, spécialites.json et categories.json."
    ]
  },
  {
    "version": "v1.8.1",
    "date": "05/01/2025 - 23:05",
    "changes": [
      "Harmonisation complète du style de la page Professeur avec les autres pages du site.",
      "Mise en place de la disposition horizontale des cartes sur toutes les pages de formulaires.",
      "Réorganisation de la sous-navigation : boutons d'action à gauche, onglets à droite.",
      "Amélioration de l'affichage des professeurs multiples avec séparateur '/' entre les noms.",
      "Optimisation du bouton de copie avec feedback visuel amélioré."
    ]
  },
  {
    "version": "v1.8.0",
    "date": "05/01/2025 - 22:50",
    "changes": [
      "Ajout de la page Professeur avec deux types de rapports : Rapport de Note (évaluation EMT) et Demande de Points (formation).",
      "Système de gestion des grades dans les paramètres avec échelons conditionnels (Paramédic, Médecin, etc.).",
      "Système de spécialités avec affichage conditionnel des onglets (PH visible uniquement si spécialité Pilote Héliporté, Professeur si spécialité Professeur).",
      "Ajout dynamique de professeurs et participants dans la page Professeur.",
      "Remplissage automatique des champs professeur avec les données des paramètres.",
      "Amélioration du style : disposition horizontale des cartes sur toutes les pages.",
      "Limitation des valeurs d'entrée pour les notes (ne peut pas dépasser le maximum de chaque catégorie).",
      "Amélioration du style des boutons de sous-navigation.",
      "Rapport généré affiché en haut de page pour une meilleure expérience utilisateur."
    ]
  },
  {
    "version": "v1.8.0",
    "date": "05/10/2025 - 19:00",
    "changes": [
      "Ajout complet de la page Professeur avec deux types de rapports : Rapport de Note et Demande de Points.",
      "Implémentation du système de grades et spécialités dans les paramètres utilisateur.",
      "Navigation conditionnelle : onglets PH et Professeur visibles uniquement selon les spécialités.",
      "Refonte de l'interface avec disposition horizontale des cartes sur toutes les pages.",
      "Ajout de la validation automatique des notes avec limitation des valeurs maximales.",
      "Amélioration du style des boutons de sous-navigation avec animations cohérentes.",
      "Remplissage automatique des champs professeur avec les données utilisateur."
    ]
  },
  {
    "version": "v1.7",
    "date": "01/08/2025 - 06:00",
    "changes": [
      "Ajout de la fonction de recherche de patient dans le Trello correspondant a la première lettre de son prénom dans le rapport de soins.",
      "Ajout d'un bouton 'Réinitialiser le rapport/fiche' dans toutes les pages concernées (rapport, morgue, impayés, refus de soin, LSPD, PH). Le bouton permet de réinitialiser le rapport ou la fiche courante aux valeurs par défaut et a été déplacé dans la barre supérieure de chaque page."
    ]
  },
  {
    "version": "v1.6.5",
    "date": "01/08/2025 - 01:50",
    "changes": [
      "Réglage du bug quand on copie un rapport (soin/refus/mogue) et qu'on le colle il n'y avais pas le gras.",
      "Ajout de la possibilité d'exporter et d'importer les statistiques.",
      "Retrait de PDS et FDS dans Service, car c'est inutile."
    ]
  },
  {
    "version": "v1.6",
    "date": "31/07/2025 - 18:30",
    "changes": [
      "Diverses améliorations de performance et de sécurité.",
      "Ajout d'une notification sur toutes les pages pour donner le moyen de signaler un bug ou une erreur."
    ]
  },
  {
    "version": "v1.5",
    "date": "31/07/2025 - 17:30",
    "changes": [
      "Nettoyage et réorganisation du code CSS : suppression des doublons, séparation des styles globaux et spécifiques (statistiques).",
      "Refonte du style de la page <b>statistiques.html</b> : styles déplacés dans le head de la page, structure HTML clarifiée.",
      "Refonte du style de la page <b>manuels.html</b> : affichage par catégories, filtres dynamiques, design responsive et moderne.",
      "Chargement dynamique des manuels depuis <b>manuels.json</b> (plus de données en dur dans le JS).",
      "Correction du chargement dynamique de la version depuis <b>changelog.json</b> sur toutes les pages.",
      "Uniformisation des styles et de la structure des headers, boutons et containers sur toutes les pages.",
      "Suppression des styles statistiques du fichier <b>style.css</b> pour alléger le CSS global."
    ]
  },
  {
    "version": "v1.4",
    "date": "31/07/2025 - 17:00",
    "changes": [
      "Refonte de l’en-tête : version et bouton informations affichés à droite du titre, header plus compact.",
      "Ajout du sticky sur le header, la barre de navigation et la sous-barre (ex : Service 1, Ajouter un service) sur toutes les pages principales.",
      "Uniformisation du style sticky sur <b>service.html</b>, <b>impayes.html</b> et autres pages."
    ]
  },
  {
    "version": "v1.3",
    "date": "31/07/2025 - 16:00",
    "changes": [
      "Ajout de la page <b>informations</b> avec versionning et changelog.",
      "Amélioration de l'affichage des manuels : regroupement par catégorie, filtres, couleurs personnalisées, auteur affiché.",
      "Statistiques : affichage graphique, tri des actions, affichage des heures en h/mn, semaines lisibles.",
      "Correction de l'auto-remplissage du nom/ID dans PH."
    ]
  },
  {
    "version": "v1.2",
    "date": "31/07/2025 - 04:30",
    "changes": [
      "Ajout du bouton de réinitialisation des statistiques.",
      "Ajout du support des auteurs sur les manuels.",
      "Amélioration de la navigation et du responsive sur toutes les pages."
    ]
  },
  {
    "version": "v1.1",
    "date": "30/07/2025 - 03:30",
    "changes": [
      "Ajout de la page <b>manuels</b> : affichage en cartes.",
      "Ajout de la page <b>statistiques</b> avec graphiques et tri avancé.",
      "Refonte du design général."
    ]
  },
  {
    "version": "v1.0",
    "date": "30/07/2025 - 02:30",
    "changes": [
      "Première version du site Aide SAMS.",
      "Pages : Service, Rapport de soins, Refus de soins, Morgue, Impayés, LSPD, PH, Paramètres."
    ]
  }
]